espressif/esp-idf/components/soc/esp32c5/register/soc/twaifd_reg.h
/** TWAIFD_INT_ENA_SET_REG register
 *  TWAI FD interrupt enable register
 */
#define TWAIFD_INT_ENA_SET_REG(i) (REG_TWAI_BASE(i) + 0x14)
/** TWAIFD_RXI_INT_ENA_MASK : R/W1S; bitpos: [0]; default: 0;
 *  Write 1 to enable TWAIFD_RXI_INT.
 */
#define TWAIFD_RXI_INT_ENA_MASK    (BIT(0))
#define TWAIFD_RXI_INT_ENA_MASK_M  (TWAIFD_RXI_INT_ENA_MASK_V << TWAIFD_RXI_INT_ENA_MASK_S)
#define TWAIFD_RXI_INT_ENA_MASK_V  0x00000001U
#define TWAIFD_RXI_INT_ENA_MASK_S  0
/** TWAIFD_TXI_INT_ENA_MASK : R/W1S; bitpos: [1]; default: 0;
 *  Write 1 to enable TWAIFD_TXI_INT.
 */
#define TWAIFD_TXI_INT_ENA_MASK    (BIT(1))
#define TWAIFD_TXI_INT_ENA_MASK_M  (TWAIFD_TXI_INT_ENA_MASK_V << TWAIFD_TXI_INT_ENA_MASK_S)
#define TWAIFD_TXI_INT_ENA_MASK_V  0x00000001U
#define TWAIFD_TXI_INT_ENA_MASK_S  1
/** TWAIFD_EWLI_INT_ENA_MASK : R/W1S; bitpos: [2]; default: 0;
 *  Write 1 to enable TWAIFD_EWLI_INT.
 */
#define TWAIFD_EWLI_INT_ENA_MASK    (BIT(2))
#define TWAIFD_EWLI_INT_ENA_MASK_M  (TWAIFD_EWLI_INT_ENA_MASK_V << TWAIFD_EWLI_INT_ENA_MASK_S)
#define TWAIFD_EWLI_INT_ENA_MASK_V  0x00000001U
#define TWAIFD_EWLI_INT_ENA_MASK_S  2
/** TWAIFD_DOI_INT_ENA_MASK : R/W1S; bitpos: [3]; default: 0;
 *  Write 1 to enable TWAIFD_DOI_INT.
 */
#define TWAIFD_DOI_INT_ENA_MASK    (BIT(3))
#define TWAIFD_DOI_INT_ENA_MASK_M  (TWAIFD_DOI_INT_ENA_MASK_V << TWAIFD_DOI_INT_ENA_MASK_S)
#define TWAIFD_DOI_INT_ENA_MASK_V  0x00000001U
#define TWAIFD_DOI_INT_ENA_MASK_S  3
/** TWAIFD_FCSI_INT_ENA_MASK : R/W1S; bitpos: [4]; default: 0;
 *  Write 1 to enable TWAIFD_FCSI_INT.
 */
#define TWAIFD_FCSI_INT_ENA_MASK    (BIT(4))
#define TWAIFD_FCSI_INT_ENA_MASK_M  (TWAIFD_FCSI_INT_ENA_MASK_V << TWAIFD_FCSI_INT_ENA_MASK_S)
#define TWAIFD_FCSI_INT_ENA_MASK_V  0x00000001U
#define TWAIFD_FCSI_INT_ENA_MASK_S  4
/** TWAIFD_ALI_INT_ENA_MASK : R/W1S; bitpos: [5]; default: 0;
 *  Write 1 to enable TWAIFD_ALI_INT.
 */
#define TWAIFD_ALI_INT_ENA_MASK    (BIT(5))
#define TWAIFD_ALI_INT_ENA_MASK_M  (TWAIFD_ALI_INT_ENA_MASK_V << TWAIFD_ALI_INT_ENA_MASK_S)
#define TWAIFD_ALI_INT_ENA_MASK_V  0x00000001U
#define TWAIFD_ALI_INT_ENA_MASK_S  5
/** TWAIFD_BEI_INT_ENA_MASK : R/W1S; bitpos: [6]; default: 0;
 *  Write 1 to enable TWAIFD_BEI_INT.
 */
#define TWAIFD_BEI_INT_ENA_MASK    (BIT(6))
#define TWAIFD_BEI_INT_ENA_MASK_M  (TWAIFD_BEI_INT_ENA_MASK_V << TWAIFD_BEI_INT_ENA_MASK_S)
#define TWAIFD_BEI_INT_ENA_MASK_V  0x00000001U
#define TWAIFD_BEI_INT_ENA_MASK_S  6
/** TWAIFD_OFI_INT_ENA_MASK : R/W1S; bitpos: [7]; default: 0;
 *  Write 1 to enable TWAIFD_OFI_INT.
 */
#define TWAIFD_OFI_INT_ENA_MASK    (BIT(7))
#define TWAIFD_OFI_INT_ENA_MASK_M  (TWAIFD_OFI_INT_ENA_MASK_V << TWAIFD_OFI_INT_ENA_MASK_S)
#define TWAIFD_OFI_INT_ENA_MASK_V  0x00000001U
#define TWAIFD_OFI_INT_ENA_MASK_S  7
/** TWAIFD_RXFI_INT_ENA_MASK : R/W1S; bitpos: [8]; default: 0;
 *  Write 1 to enable TWAIFD_RXFI_INT.
 */
#define TWAIFD_RXFI_INT_ENA_MASK    (BIT(8))
#define TWAIFD_RXFI_INT_ENA_MASK_M  (TWAIFD_RXFI_INT_ENA_MASK_V << TWAIFD_RXFI_INT_ENA_MASK_S)
#define TWAIFD_RXFI_INT_ENA_MASK_V  0x00000001U
#define TWAIFD_RXFI_INT_ENA_MASK_S  8
/** TWAIFD_BSI_INT_ENA_MASK : R/W1S; bitpos: [9]; default: 0;
 *  Write 1 to enable TWAIFD_BSI_INT.
 */
#define TWAIFD_BSI_INT_ENA_MASK    (BIT(9))
#define TWAIFD_BSI_INT_ENA_MASK_M  (TWAIFD_BSI_INT_ENA_MASK_V << TWAIFD_BSI_INT_ENA_MASK_S)
#define TWAIFD_BSI_INT_ENA_MASK_V  0x00000001U
#define TWAIFD_BSI_INT_ENA_MASK_S  9
/** TWAIFD_RBNEI_INT_ENA_MASK : R/W1S; bitpos: [10]; default: 0;
 *  Write 1 to enable TWAIFD_RBNEI_INT.
 */
#define TWAIFD_RBNEI_INT_ENA_MASK    (BIT(10))
#define TWAIFD_RBNEI_INT_ENA_MASK_M  (TWAIFD_RBNEI_INT_ENA_MASK_V << TWAIFD_RBNEI_INT_ENA_MASK_S)
#define TWAIFD_RBNEI_INT_ENA_MASK_V  0x00000001U
#define TWAIFD_RBNEI_INT_ENA_MASK_S  10
/** TWAIFD_TXBHCI_INT_ENA_MASK : R/W1S; bitpos: [11]; default: 0;
 *  Write 1 to enable TWAIFD_TXBHCI_INT.
 */
#define TWAIFD_TXBHCI_INT_ENA_MASK    (BIT(11))
#define TWAIFD_TXBHCI_INT_ENA_MASK_M  (TWAIFD_TXBHCI_INT_ENA_MASK_V << TWAIFD_TXBHCI_INT_ENA_MASK_S)
#define TWAIFD_TXBHCI_INT_ENA_MASK_V  0x00000001U
#define TWAIFD_TXBHCI_INT_ENA_MASK_S  11

/** TWAIFD_INT_ENA_CLR_REG register
 *  TWAI FD interrupt enable clear register
 */
#define TWAIFD_INT_ENA_CLR_REG(i) (REG_TWAI_BASE(i) + 0x18)
/** TWAIFD_RXI_INT_ENA_CLR : WO; bitpos: [0]; default: 0;
 *  Write 1 to clear TWAIFD_RXI_INT_ENA .
 */
#define TWAIFD_RXI_INT_ENA_CLR    (BIT(0))
#define TWAIFD_RXI_INT_ENA_CLR_M  (TWAIFD_RXI_INT_ENA_CLR_V << TWAIFD_RXI_INT_ENA_CLR_S)
#define TWAIFD_RXI_INT_ENA_CLR_V  0x00000001U
#define TWAIFD_RXI_INT_ENA_CLR_S  0
/** TWAIFD_TXI_INT_ENA_CLR : WO; bitpos: [1]; default: 0;
 *  Write 1 to clear TWAIFD_TXI_INT_ENA .
 */
#define TWAIFD_TXI_INT_ENA_CLR    (BIT(1))
#define TWAIFD_TXI_INT_ENA_CLR_M  (TWAIFD_TXI_INT_ENA_CLR_V << TWAIFD_TXI_INT_ENA_CLR_S)
#define TWAIFD_TXI_INT_ENA_CLR_V  0x00000001U
#define TWAIFD_TXI_INT_ENA_CLR_S  1
/** TWAIFD_EWLI_INT_ENA_CLR : WO; bitpos: [2]; default: 0;
 *  Write 1 to clear TWAIFD_EWLI_INT_ENA .
 */
#define TWAIFD_EWLI_INT_ENA_CLR    (BIT(2))
#define TWAIFD_EWLI_INT_ENA_CLR_M  (TWAIFD_EWLI_INT_ENA_CLR_V << TWAIFD_EWLI_INT_ENA_CLR_S)
#define TWAIFD_EWLI_INT_ENA_CLR_V  0x00000001U
#define TWAIFD_EWLI_INT_ENA_CLR_S  2
/** TWAIFD_DOI_INT_ENA_CLR : WO; bitpos: [3]; default: 0;
 *  Write 1 to clear TWAIFD_DOI_INT_ENA .
 */
#define TWAIFD_DOI_INT_ENA_CLR    (BIT(3))
#define TWAIFD_DOI_INT_ENA_CLR_M  (TWAIFD_DOI_INT_ENA_CLR_V << TWAIFD_DOI_INT_ENA_CLR_S)
#define TWAIFD_DOI_INT_ENA_CLR_V  0x00000001U
#define TWAIFD_DOI_INT_ENA_CLR_S  3
/** TWAIFD_FCSI_INT_ENA_CLR : WO; bitpos: [4]; default: 0;
 *  Write 1 to clear TWAIFD_FCSI_INT_ENA .
 */
#define TWAIFD_FCSI_INT_ENA_CLR    (BIT(4))
#define TWAIFD_FCSI_INT_ENA_CLR_M  (TWAIFD_FCSI_INT_ENA_CLR_V << TWAIFD_FCSI_INT_ENA_CLR_S)
#define TWAIFD_FCSI_INT_ENA_CLR_V  0x00000001U
#define TWAIFD_FCSI_INT_ENA_CLR_S  4
/** TWAIFD_ALI_INT_ENA_CLR : WO; bitpos: [5]; default: 0;
 *  Write 1 to clear TWAIFD_ALI_INT_ENA .
 */
#define TWAIFD_ALI_INT_ENA_CLR    (BIT(5))
#define TWAIFD_ALI_INT_ENA_CLR_M  (TWAIFD_ALI_INT_ENA_CLR_V << TWAIFD_ALI_INT_ENA_CLR_S)
#define TWAIFD_ALI_INT_ENA_CLR_V  0x00000001U
#define TWAIFD_ALI_INT_ENA_CLR_S  5
/** TWAIFD_BEI_INT_ENA_CLR : WO; bitpos: [6]; default: 0;
 *  Write 1 to clear TWAIFD_BEI_INT_ENA .
 */
#define TWAIFD_BEI_INT_ENA_CLR    (BIT(6))
#define TWAIFD_BEI_INT_ENA_CLR_M  (TWAIFD_BEI_INT_ENA_CLR_V << TWAIFD_BEI_INT_ENA_CLR_S)
#define TWAIFD_BEI_INT_ENA_CLR_V  0x00000001U
#define TWAIFD_BEI_INT_ENA_CLR_S  6
/** TWAIFD_OFI_INT_ENA_CLR : WO; bitpos: [7]; default: 0;
 *  Write 1 to clear TWAIFD_OFI_INT_ENA .
 */
#define TWAIFD_OFI_INT_ENA_CLR    (BIT(7))
#define TWAIFD_OFI_INT_ENA_CLR_M  (TWAIFD_OFI_INT_ENA_CLR_V << TWAIFD_OFI_INT_ENA_CLR_S)
#define TWAIFD_OFI_INT_ENA_CLR_V  0x00000001U
#define TWAIFD_OFI_INT_ENA_CLR_S  7
/** TWAIFD_RXFI_INT_ENA_CLR : WO; bitpos: [8]; default: 0;
 *  Write 1 to clear TWAIFD_RXFI_INT_ENA .
 */
#define TWAIFD_RXFI_INT_ENA_CLR    (BIT(8))
#define TWAIFD_RXFI_INT_ENA_CLR_M  (TWAIFD_RXFI_INT_ENA_CLR_V << TWAIFD_RXFI_INT_ENA_CLR_S)
#define TWAIFD_RXFI_INT_ENA_CLR_V  0x00000001U
#define TWAIFD_RXFI_INT_ENA_CLR_S  8
/** TWAIFD_BSI_INT_ENA_CLR : WO; bitpos: [9]; default: 0;
 *  Write 1 to clear TWAIFD_BSI_INT_ENA .
 */
#define TWAIFD_BSI_INT_ENA_CLR    (BIT(9))
#define TWAIFD_BSI_INT_ENA_CLR_M  (TWAIFD_BSI_INT_ENA_CLR_V << TWAIFD_BSI_INT_ENA_CLR_S)
#define TWAIFD_BSI_INT_ENA_CLR_V  0x00000001U
#define TWAIFD_BSI_INT_ENA_CLR_S  9
/** TWAIFD_RBNEI_INT_ENA_CLR : WO; bitpos: [10]; default: 0;
 *  Write 1 to clear TWAIFD_RBNEI_INT_ENA .
 */
#define TWAIFD_RBNEI_INT_ENA_CLR    (BIT(10))
#define TWAIFD_RBNEI_INT_ENA_CLR_M  (TWAIFD_RBNEI_INT_ENA_CLR_V << TWAIFD_RBNEI_INT_ENA_CLR_S)
#define TWAIFD_RBNEI_INT_ENA_CLR_V  0x00000001U
#define TWAIFD_RBNEI_INT_ENA_CLR_S  10
/** TWAIFD_TXBHCI_INT_ENA_CLR : WO; bitpos: [11]; default: 0;
 *  Write 1 to clear TWAIFD_TXBHCI_INT_ENA .
 */
#define TWAIFD_TXBHCI_INT_ENA_CLR    (BIT(11))
#define TWAIFD_TXBHCI_INT_ENA_CLR_M  (TWAIFD_TXBHCI_INT_ENA_CLR_V << TWAIFD_TXBHCI_INT_ENA_CLR_S)
#define TWAIFD_TXBHCI_INT_ENA_CLR_V  0x00000001U
#define TWAIFD_TXBHCI_INT_ENA_CLR_S  11

